// **Group members profiles**   
// Each profile consists of (1) avatar, (2) username, (3) personal description, (4) number of "likes" the profile will receive throughout the interaction
	
window.others = {
  "posts" : [
      {
        "avatar": "avatars/others/george.png",
        "username": "LYM",
        "text": "很多朋友对我的评价是个小太阳，可能是因为我的笑声有感染力吧，所以大家都喜欢看我笑嘻嘻的样子哈哈哈。 但我的情绪也非常极端，有时会超级开心，有时会超级难过，朋友说我很情绪化，但是转变的速度也可以很快，原本的难过也可以很快就好起来，所以很多困难都阻挡不了我！ 加上我是天生的观察加聆听者，朋友有烦心事或情绪不佳的时候我总会在第一时间察觉到，所以朋友都喜欢找我寻求帮助，因为我很快就能逗笑他们哈哈哈。",
        "likes": [45000, 50000, 110000, 150000] //4
      },
      {
        "avatar": "avatars/others/sarah.png",
        "username": "可怡",
        "text": "正处于一个想摆烂但是又无法摆烂所以在努力生存的阶段。我好像总是觉得自己哪里都不够好，尤其是太多优秀的人在我身边的时候，就会容易焦虑。感觉自己是个很念旧，感性，有时也有点悲观主义的人。因为总活在过去，所以对现在的改变感到可惜和不舍。朋友对我的评价是很乐观也很理性，但其实不完全。",
        "likes": [22000, 24000,35000,55000,80000,100000,110000,150000,20000] //9
      },
      {
        "avatar": "avatars/others/john.png",
        "username": "伟毅",
        "text": "大家好，我是一个戴眼镜的长头发的男生。喜欢做的事情是宅在房间里看动漫。最讨厌的水果是香蕉和菠萝蜜。熬夜的时候总是能够精神饱满。想从事的职业是设计方面的，可是能力还不够。",
		"likes": [20000, 21000] //2
      },
      {
        "avatar": "avatars/others/anca.png",
        "username": "婷",
        "text": "关于我自己的事，emm 我觉得我是个矛盾的人，一方面，我渴望与人分享与沟通，另一方面，我又无法正确对待他人的善意。庆幸的是我发现我正在改变，正慢慢适应社会关系的增加所带来的幸福感的增加，但我又从不是个良好的关系维护者，我很少会主动去维系关系或者增进关系。可能是我自己的社交技能不够，也有可能是我害怕他人会给我的生活带来太多的改变。",
        "likes": [20000, 22000, 40000, 80000, 120000] //5
      },
      {
        "avatar": "avatars/others/niki.png",
        "username": "杨浩宇",
        "text": "感性与理性的结合。无法敏锐地感知周围，也无法严谨地思考推理，以偏理性的身体收集周遭的经历，以偏感性的思维理解和组织信息。内心其实无情冷峻，但可以用世俗标准规范自己的表现行为。希望借助自身的独特在哲学方面思考人类的情感问题，在艺术方面做出自己满意的作品。",
        "likes": [40000, 450000, 90000, 100000, 150000, 155000] //6
      },
    {
        "avatar": "avatars/others/mary.png",
        "username": "陈伟祺",
        "text": "朋友们好，初次认识。我是个实诚的人，喜欢旅游，也去过很多国家；喜欢音乐和绘画，有时候也会自己弹奏一些乐器，或者画一些画来和大家分享。我希望自己做的是一些不违本心的事情，正直、给人帮助，对自己问心无愧，尽人事即可。",
        "likes": [20000, 55000, 95000] //3
      },
      {
        "avatar": "avatars/others/lauren.png",
        "username": "Ann",
        "text": "Halo 大家好，我是一位Malaysian，生活在马来西亚真的很幸福，可以避免于各种自然灾害，淹水除外。最近大选成功选择自己想要的执政人，非常开心，国家未来的经济发展又有希望了。作为本科第二年最后学期的学生，很忙，很充实，但也很累。希望可以快点放假。",
        "likes": [52000, 98000] //1
      },
          {
        "avatar": "avatars/others/kim.png",
        "username": "欣妤",
        "text": "我刚开始了我人生中的第一份工作。这份工作是跟特殊儿童一起的心理治疗师。刚开始这份工作时很压力，差不多每天都哭，因为我怕我胜任不了这份工作。但幸好我的同事一直开导我，支持我。现在的我不能说很好，但至少在这工作上做到很开心，尤其是看到自己的小孩进步时，会替他们感到很开心，甚至感动到流泪，那份成就感无法用言语形容。",
        "likes": [30000, 50000, 88000, 11000, 11500, 120000, 15000] //7
      },
      {
        "avatar": "avatars/others/arjen.png",
        "username": "余梓茵",
        "text": "我是一个比较理想主义的人，喜欢美好和温暖的人和事。我希望自己能够活的有意义，能够活出真正的自我，为社会做出贡献。我喜欢看书喜欢思索，听音乐唱歌弹琴，也喜欢运动。我是个敏感的人，有时候会想很多，这有利有弊，我希望自己能多发挥性格中优势的一面",
        "likes": [22000, 40000, 120000] //3
      },
      {
        "avatar": "avatars/others/heather.png",
        "username": "Y",
        "text": "近期处于一种忙碌但实际说不出来在忙啥的状态，觉得似乎有很多事情需要我去做，但不知道从哪开始着手，也没有动力。这种状态使我焦虑。我尝试着让自己的心沉静下来，着手开始一项一项的待办事项，但焦虑还是时不时会出现。所以我也开始去发展我的兴趣爱好，过去想做但没做的，比如学尤克里里，这些行动给我带来了力量。",
        "likes": [33000, 50000, 80000, 88000, 120000] //5
      },
      {
        "avatar": "avatars/others/jane.png",
        "username": "Sinyeeee",
        "text": "我觉得我是一个佛系和懒惰的人，很多时候我知道我自己该干什么的时候，但都因为懒惰，不想跳出舒适圈，然后就虚度光阴，然后开始后悔，但是下一次又总是会没动力。因为近几年的疫情原因，感觉时间过得很快又很虚，一下子疫情三年了，我好像什么都没做。我佛系是因为我觉得自己不喜欢争抢，总觉得船到桥头自然直，该有的都会有的，我自己知道这样不好，但又无力去改变现状，总是将自己藏在舒适圈里。",
        "likes": [60000, 95000] //6
      },

    ]
  };